app/controllers/balances_controller.rb

SELECT "balances".* FROM "balances" WHERE "balances"."wallet_id" = ? AND "balances"."id" = ? LIMIT ?  [["wallet_id", 1], ["id", nil], ["LIMIT", 1]]
---
  def show
    @balance = @wallet.balances.find_by(id: params[:id])

SELECT "balances".* FROM "balances" WHERE "balances"."wallet_id" = ? AND "balances"."id" = ? LIMIT ?  [["wallet_id", 1], ["id", 2], ["LIMIT", 1]]
---
  def edit
    @balance = @wallet.balances.find_by(id: params[:id])

INSERT INTO "balances" ("value", "wallet_id", "created_at", "updated_at", "currency") VALUES (?, ?, ?, ?, ?)  [["value", 290.0], ["wallet_id", 1], ["created_at", "2023-04-13 18:59:18.638084"], ["updated_at", "2023-04-13 18:59:18.638084"], ["currency", "CNY"]]
---
  def create
    @balance = @wallet.balances.new(balance_params)
    if @balance.save

SELECT "balances".* FROM "balances" WHERE "balances"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "balances" WHERE "balances"."id" = ?  [["id", 11]]
---
  def destroy
    @balance = Balance.find(params[:id])
    @balance.destroy

SELECT "balances".* FROM "balances" WHERE "balances"."wallet_id" = ? AND "balances"."id" = ? LIMIT ?  [["wallet_id", 1], ["id", 7], ["LIMIT", 1]]
---
    def set_balance
      @balance = @wallet.balances.find_by(id: params[:id])