app/controllers/wallets_controller.rb

  def create
      @wallet = Wallet.new(user_id: @user.id)
      if @wallet.save
---
INSERT INTO "wallets" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 3], ["created_at", "2023-04-12 15:06:29.143849"], ["updated_at", "2023-04-12 15:06:29.143849"]]